In [4]:
import pandas as pd

<ipython-input-4-7dd3504c366f>:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [5]:
df = pd.read_csv("./datasets/students-data.csv")

In [6]:
df

            Name  RegNo    m1    m2    m3 Result
0    Alice Smith  101.0  85.0  90.0  88.0   Pass
1    Bob Johnson  102.0  70.0   NaN  80.0   Pass
2  Charlie Brown  103.0  45.0  50.0   NaN   Fail
3      Daisy Lee  104.0   NaN  88.0  95.0   Pass
4    Ethan Davis  105.0  60.0  58.0  65.0   Pass
5   Fiona Garcia  106.0  40.0   NaN  38.0   Fail
6  George Harris  107.0  75.0  80.0  85.0   Pass
7  Hannah Wilson    NaN  50.0  48.0  52.0   Fail
8   Ian Martinez  109.0  88.0  92.0   NaN   Pass
9     Jane Clark  110.0  68.0  70.0   NaN   Pass

In [6]:
df.describe()

            RegNo         m1         m2         m3
count    9.000000   9.000000   8.000000   7.000000
mean   105.222222  64.555556  72.000000  71.857143
std      3.073181  17.088820  18.142295  20.907962
min    101.000000  40.000000  48.000000  38.000000
25%    103.000000  50.000000  56.000000  58.500000
50%    105.000000  68.000000  75.000000  80.000000
75%    107.000000  75.000000  88.500000  86.500000
max    110.000000  88.000000  92.000000  95.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   RegNo   9 non-null      float64
 2   m1      9 non-null      float64
 3   m2      8 non-null      float64
 4   m3      7 non-null      float64
 5   Result  10 non-null     object
dtypes: float64(4), object(2)
memory usage: 472.0+ bytes

In [8]:
df.isnull().sum()

Name      0
RegNo     1
m1        1
m2        2
m3        3
Result    0
dtype: int64

In [9]:
df.dtypes

Name       object
RegNo     float64
m1        float64
m2        float64
m3        float64
Result     object
dtype: object

In [12]:
df.shape

(10, 6)

In [14]:
filled_student_data = df.fillna("HI") filled_student_data = df.fillna("HI")
filled_student_data
filled_student_data

            Name  RegNo    m1    m2    m3 Result
0    Alice Smith  101.0  85.0  90.0  88.0   Pass
1    Bob Johnson  102.0  70.0    HI  80.0   Pass
2  Charlie Brown  103.0  45.0  50.0    HI   Fail
3      Daisy Lee  104.0    HI  88.0  95.0   Pass
4    Ethan Davis  105.0  60.0  58.0  65.0   Pass
5   Fiona Garcia  106.0  40.0    HI  38.0   Fail
6  George Harris  107.0  75.0  80.0  85.0   Pass
7  Hannah Wilson     HI  50.0  48.0  52.0   Fail
8   Ian Martinez  109.0  88.0  92.0    HI   Pass
9     Jane Clark  110.0  68.0  70.0    HI   Pass

In [15]:
filled_student_data = df.fillna(5)
filled_student_data

            Name  RegNo    m1    m2    m3 Result
0    Alice Smith  101.0  85.0  90.0  88.0   Pass
1    Bob Johnson  102.0  70.0   5.0  80.0   Pass
2  Charlie Brown  103.0  45.0  50.0   5.0   Fail
3      Daisy Lee  104.0   5.0  88.0  95.0   Pass
4    Ethan Davis  105.0  60.0  58.0  65.0   Pass
5   Fiona Garcia  106.0  40.0   5.0  38.0   Fail
6  George Harris  107.0  75.0  80.0  85.0   Pass
7  Hannah Wilson    5.0  50.0  48.0  52.0   Fail
8   Ian Martinez  109.0  88.0  92.0   5.0   Pass
9     Jane Clark  110.0  68.0  70.0   5.0   Pass

In [17]:
df.fillna(method="ffill")

<ipython-input-17-5a0d178a1f3e>:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

            Name  RegNo    m1    m2    m3 Result
0    Alice Smith  101.0  85.0  90.0  88.0   Pass
1    Bob Johnson  102.0  70.0  90.0  80.0   Pass
2  Charlie Brown  103.0  45.0  50.0  80.0   Fail
3      Daisy Lee  104.0  45.0  88.0  95.0   Pass
4    Ethan Davis  105.0  60.0  58.0  65.0   Pass
5   Fiona Garcia  106.0  40.0  58.0  38.0   Fail
6  George Harris  107.0  75.0  80.0  85.0   Pass
7  Hannah Wilson  107.0  50.0  48.0  52.0   Fail
8   Ian Martinez  109.0  88.0  92.0  52.0   Pass
9     Jane Clark  110.0  68.0  70.0  52.0   Pass

In [18]:
df.fillna(method="bfill")

<ipython-input-18-6bd2f34f2c60>:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill")

            Name  RegNo    m1    m2    m3 Result
0    Alice Smith  101.0  85.0  90.0  88.0   Pass
1    Bob Johnson  102.0  70.0  50.0  80.0   Pass
2  Charlie Brown  103.0  45.0  50.0  95.0   Fail
3      Daisy Lee  104.0  60.0  88.0  95.0   Pass
4    Ethan Davis  105.0  60.0  58.0  65.0   Pass
5   Fiona Garcia  106.0  40.0  80.0  38.0   Fail
6  George Harris  107.0  75.0  80.0  85.0   Pass
7  Hannah Wilson  109.0  50.0  48.0  52.0   Fail
8   Ian Martinez  109.0  88.0  92.0   NaN   Pass
9     Jane Clark  110.0  68.0  70.0   NaN   Pass

In [8]:
df.interpolate()

<ipython-input-8-11c47216a02d>:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

            Name  RegNo    m1    m2    m3 Result
0    Alice Smith  101.0  85.0  90.0  88.0   Pass
1    Bob Johnson  102.0  70.0  70.0  80.0   Pass
2  Charlie Brown  103.0  45.0  50.0  87.5   Fail
3      Daisy Lee  104.0  52.5  88.0  95.0   Pass
4    Ethan Davis  105.0  60.0  58.0  65.0   Pass
5   Fiona Garcia  106.0  40.0  69.0  38.0   Fail
6  George Harris  107.0  75.0  80.0  85.0   Pass
7  Hannah Wilson  108.0  50.0  48.0  52.0   Fail
8   Ian Martinez  109.0  88.0  92.0  52.0   Pass
9     Jane Clark  110.0  68.0  70.0  52.0   Pass

In [9]:
df.dropna()

            Name  RegNo    m1    m2    m3 Result
0    Alice Smith  101.0  85.0  90.0  88.0   Pass
4    Ethan Davis  105.0  60.0  58.0  65.0   Pass
6  George Harris  107.0  75.0  80.0  85.0   Pass